Repository: KeidsID/flutter_app_core_package
Catalog: lib/l10n/l10n_*.arb
Languages: id

# badRequestMessage
source: Error due to invalid request
id: Kesalahan karena permintaan yang tidak valid

# unauthorizedMessage
source: Authentications is required
id: Autentikasi dibutuhkan

# forbiddenMessage
source: Not allowed to be accessed
id: Tidak diizinkan untuk diakses

# notFoundMessage
source: Requested content not found
id: Sumber yang anda minta tidak ditemukan

# methodNotAllowedMessage
source: The requested method is not supported
id: Metode permintaan anda tidak didukung

# notAcceptableMessage
source: The content negotiation headers are invalid
id: Header content negotiation tidak valid

# proxyAuthenticationRequiredMessage
source: Proxy authentication is required
id: Autentikasi dari proxy dibutuhkan

# requestTimeoutMessage
source: The process is taking too long to handle
id: Proses ini terlalu lama untuk ditangani

# conflictMessage
source: There was a conflict in the server's state
id: Terjadi konflik di dalam server

# goneMessage
source: Requested content has been removed
id: Sumber yang anda minta telah dihapus

# lengthRequiredMessage
source: `Content-Length` header field is required
id: Header `Content-Length` dibutuhkan

# preconditionFailedMessage
source: The server cannot handle the precondition of your request
id: Server tidak dapat menangani prasyaratan dari permintaan anda

# payloadTooLargeMessage
source: Your request is too large to handle
id: Permintaan anda terlalu besar untuk ditangani

# uriTooLongMessage
source: The requested URI is longer than the server is willing to interpret
id: URI yang anda minta terlalu panjang dari apa yang server dapat tangani

# unsupportedMediaTypeMessage
source: The media format you provided is not supported
id: Format media yang anda berikan tidak didukung

# rangeNotSatisfiableMessage
source: The server cannot fulfill the range specified by the `Range` header field
id: Server tidak dapat memenuhi spesifikasi dari header `Range`

# expectationFailedMessage
source: The server cannot fulfill the expectation indicated by the `Expect` header field
id: Server tidak dapat memenuhi ekspetasi yang ditunjukkan oleh header `Expect`

# imATeapotMessage
source: The server refuses the attempt to brew coffee with a teapot
id: Server menolak permintaan anda untuk menyeduh kopi dengan teko

# misdirectedRequestMessage
source: Your request was directed at the wrong server
id: Permintaan anda diarahkan ke server yang salah

# unprocessableContentMessage
source: Could not be handled because of a semantic error
id: Tidak dapat ditangani karena kesalahan semantik

# lockedMessage
source: This content is inaccessible.
id: Sumber ini dilarang untuk diakses

# failedDependencyMessage
source: Error due a failure of a previous request
id: Kesalahan karena kegagalan dari permintaan sebelumnya

# upgradeRequiredMessage
source: The server won't process the request with the current protocol
id: Server tidak akan memproses permintaan anda dengan protokol saat ini

# preconditionRequiredMessage
source: Your request needs precondition headers
id: Permintaan anda membutuhkan header prasyarat

# tooManyRequestsMessage
source: Too many requests in a short time
id: Terlalu banyak permintaan dalam waktu yang singkat

# requestHeaderFieldsTooLargeMessage
source: Your request header fields are too large to handle. Check the response body for the details
id: Header permintaan anda terlalu besar untuk ditangani. Cek badan respon server untuk detail lebih lanjut

# unavailableForLegalReasonsMessage
source: This content is blocked by the government
id: Permintaan anda tidak tersedia untuk alasan yang legal

# internalServerErrorMessage
source: Sorry for the inconvenience
id: Mohon maaf atas ketidaknyamanannya

# notImplementedMessage
source: This service is unavailable at the moment
id: Layanan ini tidak tersedia untuk saat ini

# badGatewayMessage
source: Sorry for the inconvenience
id: Mohon maaf atas ketidaknyamanannya

# serviceUnavailableMessage
source: The server is unavailable at the moment
id: Server tidak tersedia untuk saat ini

# gatewayTimeoutMessage
source: Sorry for the inconvenience
id: Mohon maaf atas ketidaknyamanannya

# httpVersionNotSupportedMessage
source: The server does not support your HTTP version
id: Server tidak mendukung versi HTTP anda

# variantAlsoNegotiatesMessage
source: Sorry for the inconvenience
id: Mohon maaf atas ketidaknyamanannya

# insufficientStorageMessage
source: The server capacity is currently too full
id: Kapasitas server terlalu penuh untuk saat ini

# loopDetectedMessage
source: Infinite loop detected while processing your request
id: Perulangan tak terbatas terdeteksi saat memproses permintaan Anda

# notExtendedMessage
source: Sorry for the inconvenience
id: Mohon maaf atas ketidaknyamanannya

# networkAuthenticationRequiredMessage
source: Network authentication is required
id: Autentikasi layanan jaringan anda dibutuhkan
